Xr=146;
Yr=86;

% Для 3 маршрута примерное реальное расположение камеры в точках поворота.
Xk=[ 117 75 73 29 29 92];
Yk=[ 16 16 57 56 23 28];

%Для 3 маршрута препятствия:
X=[];Y=[];

x0=[1 1 14 14 1 0 45 45 57 57 45 0 64 64 71 71 64 0 95 104 110 101 95 0 126 129 132 129 126];y0=[7 38 38 7 7 0 43 36 36 43 43 0 73 84 84 73 73 0 41 33 39 48 41 0 73 70 73 76 73];

for k=1:length(x0)-1

    if (x0(k)~=0 || y0(k)~=0) && (x0(k+1)~=0 || y0(k+1)~=0)
        ai=k;bi=k+1;
        if x0(bi)~=x0(ai)
            a=(y0(bi)-y0(ai))/(x0(bi)-x0(ai));
            b=y0(ai)-a*x0(ai);

            x=min(x0(ai),x0(bi)):max(x0(ai),x0(bi));
            y=a*x+b;
        else
            y=min(y0(ai),y0(bi)):max(y0(ai),y0(bi));
            x=ones(size(y))*x0(ai);
        end
        X=[X x];
        Y=[Y y];
    end
end

r1=randi([-2 2],size(X));
r2=randi([-2 2],size(Y));

plot(X,Y,'o')
hold on; plot(Xk,Yk);
plot(X+r1,Y+r2,'*')
  X=X+r1  ;
  Y=Y+r2  ;
        